Revit 2024 API
BuiltInFailures.ColumnInsideWallFailures.StopCutShadowJoin Property
 Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StopCutShadowJoin { get; }
Visual Basic
Public Shared ReadOnly Property StopCutShadowJoin As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StopCutShadowJoin {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace